In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
my_list = [10,20,30]
labels = ['a','b','c']
array = np.array(my_list)
array
d = {'a':10,'b':20,'c':30}

In [4]:
pd.Series(data = my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data = my_list , index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d)
#this is a simple waay of doing ln[6]

a    10
b    20
c    30
dtype: int64

In [8]:
np.random.randn(5,4)

array([[ 0.44006129,  1.01603989, -0.55144311,  0.97464124],
       [ 0.72995052, -0.70206243, -0.18818594, -1.96560148],
       [ 0.97577054,  1.07346162, -0.68153259,  0.70788607],
       [ 0.26725126,  1.87448467,  1.0479613 , -2.20008569],
       [ 0.14225861,  0.15044407,  1.77252238,  0.47098222]])

# DataFrames()

In [9]:
from numpy.random import randn
np.random.seed(101)

In [10]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [11]:
#pd.DataFrame(data,index,columns)

In [12]:
#df = pd.DataFrame(np.eye(2,2),['a','b'],['x','y'])

In [13]:
#np.eye(2,3)

In [14]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [15]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [16]:
#SQl Method
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [17]:
df[['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077
C -2.018168  0.528813
D  0.188695 -0.933237
E  0.190794  2.605967

In [18]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [19]:
df['new'] = df['W'] + df['Y']

In [20]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [21]:
booldf = df['W']>0

In [22]:
booldf

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [23]:
df[booldf]

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [24]:
df.drop('new',axis=1)
#axis=0 for rows by default and axis =1 for columns

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [25]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [26]:
df.drop('new',axis=1,inplace=True)

In [27]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [28]:
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [29]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
#selecting rows
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
df.iloc[0]
#for selecting row usind index

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [32]:
df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [33]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [34]:
df.loc['B','Y']

-0.8480769834036315

In [35]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [38]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
df[df>0]['X']

A    0.628133
B         NaN
C    0.740122
D         NaN
E    1.978757
Name: X, dtype: float64

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df[df>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B       NaN       NaN
C  0.740122  0.528813
D       NaN       NaN
E  1.978757  2.605967

In [42]:
df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [58]:
df[(df['W']>0) | (df['Y']<0)]

          W         X         Y         Z New States
A  2.706850  0.628133  0.907969  0.503826  CA     CA
B  0.651118 -0.319318 -0.848077  0.605965  PK     PK
D  0.188695 -0.758872 -0.933237  0.955057  HK     HK
E  0.190794  1.978757  2.605967  0.683509  CO     CO

In [59]:
df

          W         X         Y         Z New States
A  2.706850  0.628133  0.907969  0.503826  CA     CA
B  0.651118 -0.319318 -0.848077  0.605965  PK     PK
C -2.018168  0.740122  0.528813 -0.589001  II     II
D  0.188695 -0.758872 -0.933237  0.955057  HK     HK
E  0.190794  1.978757  2.605967  0.683509  CO     CO

In [60]:
df.reset_index()
#reset index to default o,1,2,..,n

  index         W         X         Y         Z New States
0     A  2.706850  0.628133  0.907969  0.503826  CA     CA
1     B  0.651118 -0.319318 -0.848077  0.605965  PK     PK
2     C -2.018168  0.740122  0.528813 -0.589001  II     II
3     D  0.188695 -0.758872 -0.933237  0.955057  HK     HK
4     E  0.190794  1.978757  2.605967  0.683509  CO     CO

In [61]:
#newindex = 'CA PK II HK CO'.split()
#df['States'] = newindex

In [63]:
df.drop(['New','States'],axis=1,inplace=True)

In [64]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [67]:
newindex = 'CA PK II HK CO'.split()
df['States'] = newindex

In [68]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     PK
C -2.018168  0.740122  0.528813 -0.589001     II
D  0.188695 -0.758872 -0.933237  0.955057     HK
E  0.190794  1.978757  2.605967  0.683509     CO

In [72]:
df.set_index('States', inplace=True)
# Signature: df.set_index(keys, drop=True, append=False, inplace=False, verify_integrity=False)
# Docstring:
# Set the DataFrame index (row labels) using one or more existing
# columns. By default yields a new object.

In [73]:
df

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
PK      0.651118 -0.319318 -0.848077  0.605965
II     -2.018168  0.740122  0.528813 -0.589001
HK      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

# Multi_index and index hierarchy

In [75]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [76]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [77]:
inside

[1, 2, 3, 1, 2, 3]

In [78]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [79]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [81]:
df2 = pd.DataFrame(data = randn(6,2),index = hier_index , columns = ['A','B'])

In [82]:
df2

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [84]:
df2.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [87]:
df2.loc['G1'].loc[1]['A']

-0.49710402288933153

In [88]:
df2.loc['G2'].loc[1]['B']

1.9966522853695665

In [89]:
df2.index.names

FrozenList([None, None])

In [91]:
df2.index.names = ['Groups' , 'Index']

In [92]:
df2

                     A         B
Groups Index
G1     1     -0.497104 -0.754070
       2     -0.943406  0.484752
       3     -0.116773  1.901755
G2     1      0.238127  1.996652
       2     -0.993263  0.196800
       3     -1.136645  0.000366

In [95]:
#df2.xs()
#  Signature: df2.xs(key, axis=0, level=None, drop_level=True)
#  Docstring:
#  Returns a cross-section (row(s) or column(s)) from the
#  Series/DataFrame. Defaults to cross-section on the rows (axis=0).
df2.xs('G1')

              A         B
Index
1     -0.497104 -0.754070
2     -0.943406  0.484752
3     -0.116773  1.901755

In [98]:
df2.xs(1,level="Index")
#gives the values of G1 and G2 at index 1

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652